app/controllers/locations_controller.rb

INSERT INTO "locations" ("region", "province", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["region", 13], ["province", "Metro Manila"], ["city", "Quezon City"], ["created_at", "2017-11-12 05:54:19.859712"], ["updated_at", "2017-11-12 05:54:19.859712"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

UPDATE "locations" SET "province" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["province", "Metro Manil"], ["updated_at", "2017-11-12 05:54:29.959579"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @location.update(location_params)